Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: འདི་ལྟ་སྟེ་གཅིག་ཏུ་གྱུར་ནས་མང་པོར་གྱུར་པ་དང་། མང་པོར་གྱུར་ནས་གཅིག་ཏུ་གྱུར་པ་དང་། སྣང་བར་གྱུར་ཅིང་མི་སྣང་བར་གྱུར་པའི་ཡེ་ཤེས་མཐོང་བ་ཉམས་སུ་མྱོང་བར་བྱེད་ཅིང་རྩིག་པ་ལ་ཡང་ཐད་ཀར་འགྲོ།
en: namely, he becomes many after being one; he becomes one after being many; he experiences the perfect knowledge of being visible and invisible;

source: རི་ལ་ཡང་ཐད་ཀར་འགྲོ།
en: and he can even pass through a wall, a mountain, or a fence.

source: ར་བ་ལ་ཡང་ཐད་ཀར་འགྲོའོ། །ལུས་ཀྱིས་ཐོགས་པ་མེད་པར་འགྲོ་བ་ནི་དཔེར་ན་ས་དང་ནམ་མཁའ་ལ་བྱ་བ་བཞིན་ནོ། །ས་ལ་ཡང་སྟེང་དུ་འགྲོ་བ་དང་། བྱིའུ་ཟུལ་བྱེད་དེ། དཔེར་ན་ཆུ་ལ་བྱ་བ་བཞིན་ནོ།
en: With his body he moves without obstacles as if in the sky; he moves on the surface of the ground and dives into it as if into water;

source: །ཆུ་ལ་ཡང་རྒྱུན་ཕྱོགས་ལས་བཟློག་པར་འགྲོ་སྟེ། དཔེར་ན་ས་ལ་བྱ་བ་བཞིན་ནོ།
en: he moves in water against the current as if on the ground;

source: །ནམ་མཁའ་ལ་ཡང་སྐྱིལ་མོ་ཀྲུང་གིས་འགྲོ་སྟེ། དཔེར་ན་འདབ་ཆགས་བྱ་བཞིན་ནོ།
en: he moves through the sky with his legs crossed as if he were a flying bird.

source: །ཉི་མ་དང་ཟླ་བ་འདི་ལྟར་རྫུ་འཕྲུལ་ཆེ་ཞིང་འདི་ལྟར་མཐུ་ཆེ་བ་འདི་གཉིས་ལ་ལག་པས་འཛིན་ཅིང་ཉུག་པར་བྱེད་དོ།
en: He seizes and touches the sun and the moon, which themselves have great magical power and great might.

source: །ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་ལུས་ཀྱིས་དབང་སྒྱུར་རོ།
en: With his body he controls the world including the world of Brahmā.

source: །དཔེར་ན་གསེར་མགར་རམ་གསེར་མགར་གྱི་སློབ་མ་མཁས་པ་ཞིག་གིས་གསེར་ཤིན་ཏུ་ལས་སུ་རུང་བར་བྱས་པར་རིག་ནས་རྡུངས་སུ་བྱ་བའི་རྣམ་པ་ཕོར་བུའམ། མགུལ་རྒྱན་ནམ། ལག་རྒྱན་ནམ། རྐང་རྒྱན་ནམ། སོར་གདུབ་རྒྱའམ། གསེར་གྱི་ཕྲེང་བ་གང་དང་གང་བྱེད་འདོད་པ་དེ་མྱུར་བ་མྱུར་བར་བྱེད་པ་དེ་བཞིན་དུ།
en: “It is just as, for instance, a goldsmith or a skillful pupil of a goldsmith, knowing that the gold is well prepared, quickly hammers out various things that he wants to make, namely, bowls, necklaces, bracelets, anklets, signet rings, and golden garlands.

source: དེ་འདི་ལྟར་མཉམ་པར་བཞག་པའི་སེམས་ཡོངས་སུ་དག་པ། རྣམ་པར་བྱང་བ། ཉོན་མོངས་པ་མེད་པ། ཉེ་བའི་ཉོན་མོངས་པ་དང་བྲལ་བ། དྲང་པོར་གྱུར་པ།
en: So too, he, with his mind adjusted, clean, pure, free from the primary defilements, free from lesser defilements, straightened, active, and unmoved, inclines his mind toward the supernormal knowledge with which he actualizes the domains of magical powers:

source: ལས་སུ་རུང་བ་ལ་གནས་པ། མི་གཡོ་བ་ཐོབ་པ། རྫུ་འཕྲུལ་གྱི་ཡུལ་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བའི་མངོན་པར་ཤེས་པ་ལ་སེམས་མངོན་དུ་གཏོད་པར་བྱེད་དེ། འདི་ལྟ་སྟེ་གཅིག་ཏུ་གྱུར་ནས་མང་པོར་གྱུར་པ་དང་ཞེས་བྱ་བ་ནས་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་ལུས་ཀྱིས་དབང་སྒྱུར་རོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: namely, he becomes many after being one; . . . . With his body he controls the world including the world of Brahmā.

source: །དཔེར་ན་རྫ་མཁན་ནམ་རྫ་མཁན་གྱི་སློབ་མ་མཁས་པ་ཞིག་གིས་འཇིམ་པའི་གོང་བུ་ཤིན་ཏུ་ལས་སུ་རུང་བར་བྱས་པར་རིག་ནས་སྣོད་སྤྱད་ཀྱི་རྣམ་གྲངས་གང་དང་གང་བསྒྲུབ་པར་འདོད་པ་དེ་དང་དེ་ཁོ་ན་མྱུར་བ་མྱུར་བར་སྒྲུབ་པ་དེ་བཞིན་དུ། དེ་འདི་ལྟར་མཉམ་པར་བཞག་པའི་སེམས་ཡོངས་སུ་དག་པ། རྣམ་པར་བྱང་བ། ཉོན་མོངས་པ་མེད་པ།
en: “Just as for instance, a potter or a skillful pupil of a potter, knowing that a lump of clay is well prepared, quickly makes various kinds of containers that he wants to make, so too, he, with his mind adjusted, clean, pure, free from the primary defilements, free from lesser defilements, straightened, active, and unmoved, inclines his mind toward the supernormal knowledge with which he actualizes the domains of magical powers:

source: ཉེ་བའི་ཉོན་མོངས་པ་དང་བྲལ་བ་ཞེས་བྱ་བ་ནས་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་ལུས་ཀྱིས་དབང་སྒྱུར་རོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: namely, he becomes many after being one; . . . . With his body he controls the world including the world of Brahmā.

source: །དཔེར་ན་བ་སོ་མཁན་ནམ་བ་སོ་མཁན་གྱི་སློབ་མ་མཁས་པ་ཞིག་གིས་བ་སོ་ཤིན་ཏུ་ལས་སུ་རུང་བར་བྱས་པར་རིག་ནས་གཟུགས་ཀྱི་རྣམ་གྲངས་གང་དང་གང་བསྒྲུབ་པར་འདོད་པ་དེ་དང་དེ་ཁོ་ན་མྱུར་བ་མྱུར་བར་སྒྲུབ་པ་དེ་བཞིན་དུ། དེ་འདི་ལྟར་མཉམ་པར་བཞག་པའི་སེམས་ཡོངས་སུ་དག་པ།
en: “Just as for instance, an ivory carver or a skillful pupil of an ivory carver, knowing that the ivory is well prepared, quickly makes various kinds of objects that he wants to make, so too, he, with his mind adjusted, clear, pure, free from the primary defilements, free from lesser defilements, straightened, active, and unmoved, inclines his mind toward the supernormal knowledge with which he actualizes the domains of magical powers:

source: རྣམ་པར་བྱང་བ་ཞེས་བྱ་བ་ནས་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་ལུས་ཀྱིས་དབང་སྒྱུར་རོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ། །དེ་འདི་ལྟར་མཉམ་པར་བཞག་པའི་སེམས་ཡོངས་སུ་དག་པ། རྣམ་པར་བྱང་བ། ཉོན་མོངས་པ་མེད་པ།
en: namely, he becomes many after being one; . . . . With his body he controls the world including the world of Brahmā.

source: ཉེ་བའི་ཉོན་མོངས་པ་དང་བྲལ་བ། དྲང་པོར་གྱུར་པ། ལས་སུ་རུང་བ་ལ་གནས་པ། མི་གཡོ་བ་ཐོབ་པ། ལྷའི་རྣ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བ་ལ་སེམས་མངོན་དུ་གཏོད་པར་བྱེད་དེ།
en: “And thus he, with his mind adjusted, clear, pure, free from the primary defilements, free from lesser defilements, straightened, active, and unmoved, also inclines his mind toward the supernormal knowledge with which he actualizes the knowledge of divine hearing.

source: དེ་ལྷའི་རྣ་བ་རྣམ་པར་དག་པ་མིའི་ལས་འདས་པས་མི་རྣམས་ཀྱིའམ། མི་མ་ཡིན་པ་རྣམས་ཀྱིའམ། གང་དག་རིང་པོའམ། གང་དག་ཉེ་བའི་སྒྲ་གཉི་ག་ཐོས་པར་བྱེད་དོ།
en: With his pure divine hearing, which is superior to that of humans, he hears the voices of humans and nonhumans, whether distant or close.

source: །དཔེར་ན་མི་དུང་འབུད་པ་ཞིག་རི་བྲག་ཆེན་པོའི་ཁར་འཛེགས་ནས་མཚན་མོ་ནམ་ཕྱེད་ཀྱི་དུས་སུ་དུང་བུས་ན་དེའི་སྒྲ་དེས་སའི་ཕྱོགས་ཐོགས་པ་མེད་པར་ཁྱབ་པར་འགྱུར་བ་དེ་བཞིན་དུ། དེ་འདི་ལྟར་མཉམ་པར་བཞག་པའི་སེམས་ཡོངས་སུ་དག་པ། རྣམ་པར་བྱང་བ། ཉོན་མོངས་པ་མེད་པ།
en: “As an analogy, if a conch blower climbs a high mountain and blows a conch at midnight, the sound will fill every direction in the land without any obstacles.

source: ཉེ་བའི་ཉོན་མོངས་པ་དང་བྲལ་བ། དྲང་པོར་གྱུར་པ། ལས་སུ་རུང་བ་ལ་གནས་པ། མི་གཡོ་བ་ཐོབ་པ། ལྷའི་རྣ་བ་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བའི་མངོན་པར་ཤེས་པ་ལ་སེམས་མངོན་དུ་གཏོད་པར་བྱེད་དེ།
en: So too, he, with his mind adjusted, clear, pure, free from the primary defilements, free from lesser defilements, straightened, active, and unmoved, inclines his mind toward the supernormal knowledge with which he actualizes the knowledge of divine hearing.

source: །དེ་འདི་ལྟར་མཉམ་པར་བཞག་པའི་སེམས་ཡོངས་སུ་དག་པ། རྣམ་པར་བྱང་བ། ཉོན་མོངས་པ་མེད་པ། ཉེ་བའི་ཉོན་མོངས་པ་དང་བྲལ་བ། དྲང་པོར་གྱུར་པ།
en: “And thus he, with his mind adjusted, clear, pure, free from the primary defilements, free from lesser defilements, straightened, active, and unmoved, also inclines his mind toward the supernormal knowledge with which he actualizes the knowledge of various states of mind.

source: ལས་སུ་རུང་བ་ལ་གནས་པ། མི་གཡོ་བ་ཐོབ་པ། སེམས་ཀྱི་རྣམ་གྲངས་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བའི་མངོན་པར་ཤེས་པ་ལ་སེམས་མངོན་པར་གཏོད་པར་བྱེད་དེ། དེས་སེམས་ཅན་གཞན་རྣམས་ཀྱི་དང་། གང་ཟག་གཞན་རྣམས་ཀྱི་རྣམ་པར་རྟོག་པ་དང་རྣམ་པར་དཔྱོད་པའི་ཡིད་ཡིད་ཀྱིས་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་ཏེ།
en: He knows with his mind the minds, which consist of thought and investigation, of other beings and other people exactly as they are:

source: འདོད་ཆགས་དང་བཅས་པའི་སེམས་ལ་འདོད་ཆགས་དང་བཅས་པའི་སེམས་ཡིན་ནོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: he correctly recognizes a mind possessed of desire exactly as it is;

source: །འདོད་ཆགས་དང་བྲལ་བའི་སེམས་ལ་འདོད་ཆགས་དང་བྲལ་བའི་སེམས་ཡིན་ནོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: he correctly recognizes a mind free from desire exactly as it is;

source: །ཞེ་སྡང་དང་བཅས་པ་དང་། ཞེ་སྡང་དང་བྲལ་བ་དང་། གཏི་མུག་དང་བཅས་པ་དང་། གཏི་མུག་དང་བྲལ་བ་དང་། བསྡུས་པ་དང་། རྣམ་པར་གཡེངས་པ་དང་། ཞུམ་པ་དང་། རབ་ཏུ་འཛིན་པ་དང་། ཆུང་ངུ་དང་། ཆེན་པོ་དང་། རྒོད་པ་དང་། རྒོད་པ་མ་ཡིན་པ་དང་། ཉེ་བར་ཞི་བ་དང་། ཉེ་བར་ཞི་བ་མ་ཡིན་པ་དང་། མཉམ་པར་བཞག་པ་དང་། མཉམ་པར་བཞག་པ་མ་ཡིན་པ་དང་། བསྒོམས་པ་དང་། བསྒོམས་པ་མ་ཡིན་པ་དང་། སེམས་རྣམ་པར་གྲོལ་བ་དང་། སེམས་རྣམ་པར་གྲོལ་བ་མ་ཡིན་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །དཔེར་ན་སྐྱེས་བུ་མིག་དང་ལྡན་པས་མེ་ལོང་གི་དཀྱིལ་འཁོར་ཡོངས་སུ་དག་པར་བྱས་ཏེ། རང་གི་བཞིན་གྱི་མཚན་མ་རྟོག་པར་བྱེད་པ་དེ་བཞིན་དུ། དེ་འདི་ལྟར་མཉམ་པར་བཞག་པའི་སེམས་ཡོངས་སུ་དག་པ། རྣམ་པར་བྱང་བ། ཉོན་མོངས་པ་མེད་པ། ཉེ་བའི་ཉོན་མོངས་པ་དང་བྲལ་བ།
en: and he correctly recognizes minds possessed of anger, free from anger, possessed of delusion, free from delusion, concentrated, distracted, discouraged, uplifted, small, large, restless, not restless, pacified, unpacified, settled, unsettled, developed, undeveloped, liberated, and unliberated exactly as they are.

source: དྲང་པོར་གྱུར་པ། ལས་སུ་རུང་བ་ལ་གནས་པ། མི་གཡོ་བ་ཐོབ་པ། སེམས་ཀྱི་རྣམ་གྲངས་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བའི་མངོན་པར་ཤེས་པ་ལ་སེམས་མངོན་དུ་གཏོད་པར་བྱེད་དེ་ཞེས་བྱ་བ་ནས། སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ་ལ་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ་ཡིན་ནོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་སོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་ཏེ།
en: “Just as, for instance, a man of keen eyes completely cleanses the disk of a mirror and observes the characteristics of his face, he, with his mind adjusted, clear, pure, free from the primary defilements, free from lesser defilements, straightened, active, and unmoved, inclines his mind toward the supernormal knowledge with which he actualizes the knowledge of various states of mind . . . . He correctly recognizes a well-liberated mind exactly as it is.

source: འདི་ནི་ཞབས་ཞེས་བྱའོ། །རིག་པ་གང་ཞེ་ན། དེ་འདི་ལྟར་མཉམ་པར་བཞག་པའི་སེམས་ཡོངས་སུ་དག་པ། རྣམ་པར་བྱང་བ། ཉོན་མོངས་པ་མེད་པ།
en: “Thus, ‘conduct’ is explained. “What is ‘knowledge’?

source: ཉེ་བའི་ཉོན་མོངས་པ་དང་བྲལ་བ། དྲང་པོར་གྱུར་པ། ལས་སུ་རུང་བ་ལ་གནས་པ། མི་གཡོ་བ་ཐོབ་པ། སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བའི་མངོན་པར་ཤེས་པ་ལ་སེམས་མངོན་དུ་གཏོད་པར་བྱེད་དེ། དེ་སྔོན་གྱི་གནས་རྣམ་པ་དུ་མ་རྗེས་སུ་དྲན་ཏེ།
en: With his mind adjusted, clear, pure, free from the primary defilements, free from lesser defilements, straightened, active, and unmoved, he inclines his mind toward the supernormal knowledge with which he actualizes the knowledge of the recollection of past lives. He recollects many past lives, namely, one life; two lives; three, four, five, six, seven, eight, nine, ten, twenty, thirty, forty, fifty, a hundred, a thousand, and a hundred thousand lives; hundreds, thousands, and hundreds of thousands of lives; an eon of destruction;

source: འདི་ལྟ་སྟེ་སྐྱེ་བ་གཅིག་དང་། གཉིས་དང་། གསུམ་དང་། བཞི་དང་། ལྔ་དང་། དྲུག་དང་། བདུན་དང་། བརྒྱད་དང་། དགུ་དང་། བཅུ་དང་། ཉི་ཤུ་དང་། སུམ་བཅུ་དང་། བཞི་བཅུ་དང་། ལྔ་བཅུ་དང་། སྐྱེ་བ་བརྒྱ་དང་། སྐྱེ་བ་སྟོང་དང་། སྐྱེ་བ་བརྒྱ་སྟོང་དང་། སྐྱེ་བ་བརྒྱ་ཕྲག་དུ་མ་དང་། སྐྱེ་བ་སྟོང་ཕྲག་དུ་མ་དང་། སྐྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། འཇིག་པའི་བསྐལ་པ་དང་། འཆགས་པའི་བསྐལ་པ་དང་། འཇིག་པ་དང་འཆགས་པའི་བསྐལ་པ་དང་། འཆགས་པའི་བསྐལ་པ་དུ་མ་དང་། འཇིག་པའི་བསྐལ་པ་དུ་མ་དང་། འཆགས་པ་དང་འཇིག་པའི་བསྐལ་པ་དུ་མ་རྗེས་སུ་དྲན་ཏེ།
en: an eon of creation; an eon of destruction and creation; many eons of destruction; many eons of creation; and many eons of destruction and creation.

source: གང་དུ་བདག་སེམས་ཅན་འདི་དག་གི་ནང་དུ་སྐྱེས་པ་ན་མིང་ནི་འདི་ཞེས་བྱ། རིགས་ནི་འདི་ཞེས་བྱ། རུས་ནི་འདི་ཞེས་བྱ། ཁ་ཟས་ནི་འདི་ལྟ་བུ་ཞིག་ཟ་ཟ། བདེ་བ་དང་སྡུག་བསྔལ་ནི་འདི་ལྟ་བུ་ཞིག་མྱོང་ངོ་།
en: ‘When I was born among these beings, my name was such-and-such, my birth was such-and-such, my family was such-and-such, I ate such-and-such foods, and I experienced such-and-such happiness and pain.

source: །ཚེ་རིང་ཁྱད་ནི་འདི་ཙམ་ཞིག །ཡུན་ནི་འདི་སྲིད་ཅིག་གནས། ཚེ་ནི་འདི་ཙམ་ཞིག་ཐུབ་བོ།
en: My life was this long, my age was this great, and I attained such longevity.

source: །དེ་ནས་བདག་ཤི་འཕོས་ནས་ཆེ་གེ་མོ་ཞིག་ཏུ་སྐྱེས་སོ།
en: Then I died and was born as such-and-such.

source: །དེ་ནས་ཀྱང་ཤི་འཕོས་ནས་ཡང་ག་གེ་མོ་ཞིག་ཏུ་སྐྱེས་སོ།
en: I died there and was reborn as such-and-such.

source: །དེ་ནས་ཀྱང་ཤི་འཕོས་ནས་འདིར་སྐྱེས་སོ་ཞེས་རྣམ་པ་དང་བཅས། ཡུལ་ཕྱོགས་དང་བཅས། གཞི་ཅི་ལས་གྱུར་པ་དང་བཅས་པར་སྔོན་གྱི་གནས་རྣམ་པ་དུ་མ་རྗེས་སུ་དྲན་ནོ།
en: I again died there and was born here.’ Thus he recollects various past lives along with their characteristics, regions, and origins from which he was born.

source: །དཔེར་ན་མི་ཞིག་གྲོང་ནས་གྲོང་དུ་སོང་ལ། དེ་ནས་ཀྱང་གྲོང་གཞན་དུ་སོང་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “It is just as, for instance, a man goes from one village to another village, and then he goes to another village and thinks thus:

source: བདག་གིས་གྲོང་ཆེ་གེ་མོ་ནས་ག་གེ་མོར་སོན་ཏོ།
en: ‘I went from the village such-and-such to the village such-and-such.

source: །དེ་ནས་ཀྱང་གྲོང་ཆེ་གེ་མོར་རོ།
en: Then I went to the village such-and-such.

source: །གྲོང་དེ་ནས་ནི་གྲོང་འདིར་འོངས་སོ་སྙམ་པ་དེ་བཞིན་དུ་དེ་འདི་ལྟར་མཉམ་པར་བཞག་པའི་སེམས་ཡོངས་སུ་དག་པ། རྣམ་པར་བྱང་བ། ཉོན་མོངས་པ་མེད་པ། ཉེ་བའི་ཉོན་མོངས་པ་དང་བྲལ་བ། དྲང་པོར་གྱུར་པ། ལས་སུ་རུང་བ་ལ་གནས་པ། མི་གཡོ་བ་ཐོབ་པ། སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བའི་མངོན་པར་ཤེས་པ་ལ་སེམས་མངོན་དུ་གཏོད་པར་བྱེད་དེ། དེ་སྔོན་གྱི་གནས་རྣམ་པ་དུ་མ་རྗེས་སུ་དྲན་ཏེ།
en: From that village, I came to this village.’ So too, he, with his mind adjusted, clear, pure, free from the primary defilements, free from lesser defilements, straightened, active, and unmoved, inclines his mind toward the supernormal knowledge with which he actualizes the knowledge of the recollection of past lives. He recollects many past lives:

source: འདི་ལྟ་སྟེ། སྐྱེ་བ་གཅིག་དང་ཞེས་བྱ་བ་ནས་རྣམ་པ་དང་བཅས།
en: namely, one life . . . .

source: ཡུལ་ཕྱོགས་དང་བཅས་པར་སྔོན་གྱི་གནས་རྣམ་པ་དུ་མ་རྗེས་སུ་དྲན་ནོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།། །།འདུལ་བ་གཞི། བམ་པོ་སུམ་བཅུ་རྩ་གཉིས་པ། དེ་འདི་ལྟར་མཉམ་པར་བཞག་པའི་སེམས་ཡོངས་སུ་དག་པ། རྣམ་པར་བྱང་བ། ཉོན་མོངས་པ་མེད་པ།
en: He recollects various past lives along with their characteristics and regions.

source: ཉེ་བའི་ཉོན་མོངས་པ་དང་བྲལ་བ། དྲང་པོར་གྱུར་པ། ལས་སུ་རུང་བ་ལ་གནས་པ། མི་གཡོ་བ་ཐོབ་པ། འཆི་འཕོ་དང་སྐྱེ་བ་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བའི་མངོན་པར་ཤེས་པ་ལ་སེམས་མངོན་དུ་གཏོད་པར་བྱེད་དེ།
en: “He, with his mind adjusted, clear, pure, free from the primary defilements, free from lesser defilements, straightened, active, and unmoved, inclines his mind toward the supernormal knowledge with which he actualizes the knowledge of death and rebirth.

source: དེ་ལྷའི་མིག་རྣམ་པར་དག་པ་མིའི་ལས་འདས་པས་སེམས་ཅན་རྣམས་ཀྱི་འཆི་འཕོ་རྣམས་དང་། སྐྱེ་བ་རྣམས་དང་། ཁ་དོག་བཟང་པོ་རྣམས་དང་། ཁ་དོག་ངན་པ་རྣམས་དང་། དམན་པ་རྣམས་དང་། གྱ་ནོམ་པ་རྣམས་དང་། བདེ་འགྲོ་དང་ངན་འགྲོར་འགྲོ་བ་རྣམས་ཀྱང་མཐོང་ཞིང་སེམས་ཅན་ལས་ཇི་ལྟ་བ་བཞིན་ཉེ་བར་འགྲོ་བ་རྣམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་ཏེ།
en: With his pure divine sight, which is superior to that of humans, he sees the death and rebirth of beings, noble and ignoble races, inferior and superior people, and pleasurable and inferior modes of existence. He knows that beings go to their next births according to their actions exactly as they performed them.

source: སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱི་ཉེས་པར་སྤྱོད་པ་དང་ལྡན། ངག་དང་ཡིད་ཀྱི་ཉེས་པར་སྤྱོད་པ་དང་ལྡན། འཕགས་པ་རྣམས་ལ་སྐུར་པ་འདེབས་པ་དང་། ལོག་པར་ལྟ་བ་དང་ལོག་པར་ལྟ་བའི་ཆོས་ཀྱི་ལས་བླངས་པའི་རྒྱུས་རྒྱུ་དེ་དང་རྐྱེན་དེས་ལུས་ཞིག་ནས་ཤི་བའི་འོག་ཏུ་ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེ་བར་འགྱུར་རོ། །སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱི་ལེགས་པར་སྤྱོད་པ་དང་ལྡན། ངག་དང་ཡིད་ཀྱི་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ།
en: ‘These beings performed evil acts of the body and evil acts of speech and mind, they falsely accused noble ones, and they accepted false doctrines and behaviors connected with the teachings of false doctrines. From these causes and conditions, they will be born in hells, which are inferior modes of existence, inferior states of existence, and a great fall, after the destruction of the body. These beings performed virtuous acts of the body and virtuous acts of speech and mind, and they did not falsely accuse noble ones, but they accepted right doctrines and behaviors connected with the teachings of right doctrines.

source: འཕགས་པ་རྣམས་ལ་སྐུར་པ་མི་འདེབས་པ་དང་། ཡང་དག་པར་ལྟ་བ་དང་ཡང་དག་པར་ལྟ་བའི་ཆོས་ཀྱི་ལས་བླངས་པའི་རྒྱུས་རྒྱུ་དེ་དང་རྐྱེན་དེས་ལུས་ཞིག་ནས་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་ལྷ་རྣམས་སུ་སྐྱེ་བར་འགྱུར་རོ།
en: From these causes and conditions, they will be born among the gods in the heavens, which are pleasurable modes of existence, after the destruction of the body.’

source: །དཔེར་ན་སྐྱེས་བུ་མིག་དང་ལྡན་པ་ཞིག་ལམ་པོ་ཆེའི་བཞི་མདོར་འདུག་ནས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་འོང་བ་དང་། འདུག་པ་དང་། ཉལ་བ་དང་། ཐ་དད་པར་འགྲོ་བ་རྣམས་ཀྱང་མཐོང་བ་དེ་བཞིན་དུ་ལྷའི་མིག་རྣམ་པར་དག་པ་མིའི་ལས་འདས་པས་ཞེས་བྱ་བ་ནས། ལྷ་རྣམས་སུ་སྐྱེ་བར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ། །དེ་མཉམ་པར་བཞག་པའི་སེམས་ཡོངས་སུ་དག་པ། རྣམ་པར་བྱང་བ། ཉོན་མོངས་པ་མེད་པ།
en: “Just as, for instance, a man of keen eyes, sitting in the middle of a crossroad of main streets, observes many people come, sit, recline, and go to other places, so too, he, with his pure divine sight, which is superior to that of humans . . . : ‘. . . they will be born among the gods.’

source: ཉེ་བའི་ཉོན་མོངས་པ་དང་བྲལ་བ། དྲང་པོར་གྱུར་པ། ལས་སུ་རུང་བ་ལ་གནས་པ། མི་གཡོ་བ་ཐོབ་པ། ཟག་པ་ཟད་པ་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བའི་མངོན་པར་ཤེས་པ་ལ་སེམས་མངོན་དུ་གཏོད་པར་བྱེད་དེ།
en: “With his mind adjusted, clear, pure, free from the primary defilements, free from lesser defilements, straightened, active, and unmoved, he also inclines his mind toward the supernormal knowledge with which he actualizes the knowledge of the exhaustion of impurities.

source: དེ་འདི་ནི་སྡུག་བསྔལ་འཕགས་པའི་བདེན་པ་ཡིན་ནོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་སོ།
en: He correctly knows thus: ‘This is suffering, which is a truth of the noble ones,’ exactly as it is.

source: །འདི་ནི་སྡུག་བསྔལ་ཀུན་འབྱུང་དང་། འདི་ནི་སྡུག་བསྔལ་འགོག་པ་དང་། འདི་ནི་སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་འཕགས་པའི་བདེན་པ་ཡིན་ནོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་སོ།
en: He correctly knows thus: ‘This is the origination of suffering, the cessation of suffering, and the path to the cessation of suffering, which are the truths of the noble ones,’ exactly as they are.

source: །དེ་དེ་ལྟར་ཤེས་ཤིང་དེ་ལྟར་མཐོང་ནས་འདོད་པའི་ཟག་པ་ལས་སེམས་རྣམ་པར་གྲོལ་བ་དང་། སྲིད་པའི་ཟག་པ་དང་། མ་རིག་པའི་ཟག་པ་ལས་སེམས་རྣམ་པར་གྲོལ་བར་འགྱུར་རོ།
en: When he has thus known and seen, his mind is liberated from the impurities of desire, and his mind is liberated from the impurities of existence and ignorance. Having been liberated, he sees thus with the very knowledge of liberation:

source: །རྣམ་པར་གྲོལ་ནས་བདག་གི་སྐྱེ་བ་ཟད་དོ།
en: ‘My births have been exhausted.

source: །ཚངས་པར་སྤྱོད་པ་བསྟེན་ཏོ།
en: The pure life has been lived.

source: །སྲིད་པ་འདི་ལས་གཞན་མི་ཤེས་སོ་ཞེས་རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་ཉིད་མཐོང་བར་འགྱུར་རོ།
en: I will not know another existence.’

source: །དཔེར་ན་གྲོང་ངམ་གྲོང་རྡལ་དང་ཧ་ཅང་ཡང་ཐག་མི་རིང་བ་ཞིག་ན་མཚོ་བྲན་གཏིང་ཟབ་པ། ཆུ་གསལ་བ། དང་བ། རྣམ་པར་དང་བ་ཞིག་ཡོད་ལ།
en: “It is just as, for instance, near a village or town there may be a deep lake in which the water is clear, pure, completely pure.

source: དེ་ལ་སྐྱེས་བུ་མིག་དང་ལྡན་པ་ཞིག་འགྲམ་དུ་འདུག་ནས་གསེག་མའམ། གྱོ་མོའམ། ཉའམ། རུ་སྦལ་ལམ། ཉ་ཕྱིས་སམ། དུང་རྣམས་མཐོང་བ་དེ་བཞིན་དུ།
en: There a man of keen eyes, sitting on the bank, may observe pebbles, gravel, fish, turtles, pearl oysters, or bivalve shells.

source: དེ་འདི་ལྟར་མཉམ་པར་བཞག་པའི་སེམས་ཡོངས་སུ་དག་པ། རྣམ་པར་བྱང་བ། ཉོན་མོངས་པ་མེད་པ། ཉེ་བའི་ཉོན་མོངས་པ་དང་བྲལ་བ་དྲང་པོར་གྱུར་པ། ལས་སུ་རུང་བ་ལ་གནས་པ། མི་གཡོ་བ་ཐོབ་པ་ཞེས་བྱ་བ་ནས། འདི་ལས་སྲིད་པ་གཞན་མི་ཤེས་སོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: So too, he, with his mind adjusted, clean, pure, free from the primary defilements, free from lesser defilements, straightened, active, and unmoved, . . . ‘ . . . I will not know another existence.’

source: །འདི་ནི་རིག་པ་ཞེས་བྱ་སྟེ།
en: “Thus, ‘knowledge’ is explained.

source: གོང་མའི་ཞབས་དང་འདི་གཉིས་གཅིག་ཏུ་བསྡོམས་པ་ལ་རིག་པ་དང་ཞབས་ཞེས་བྱའོ།
en: This and the aforementioned conduct are combined and called knowledge and conduct.

source: །བྲམ་ཟེའི་ཁྱེའུ་བླ་ན་མེད་པའི་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་དེ་མངོན་སུམ་དུ་མ་བྱས་པ་མངོན་སུམ་དུ་བྱ་བ་ལ་ཐབས་མ་ཡིན་པ་བཞིར་རིག་པར་བྱ་སྟེ།
en: “Young brahmin, you should know the four wrong means for actualizing the unactualized supreme perfection of knowledge and conduct.

source: བཞི་གང་ཞེ་ན།
en: What are the four?

source: འདི་ལ་དགེ་སྦྱོང་དང་བྲམ་ཟེ་ཁ་ཅིག་བླ་ན་མེད་པའི་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་འདི་ཉིད་མངོན་པར་མ་རྟོགས་པར་གྲོང་ནས་དགོན་པར་སོང་ནས་ཡལ་ག་དང་ལོ་མའི་སྤྱིལ་བུ་བྱས་ཏེ་གནས་པར་བྱེད་དེ།
en: “Here some śramaṇas or brahmins, not actualizing this supreme perfection of knowledge and conduct, go from a village to the wilderness and live there, having built huts of branches and leaves.

source: འདི་ན་བདག་ཅག་རྩ་བ་དང་འབྲས་བུས་འཚོ་བར་བྱའོ་ཞེས་དེ་རྣམས་དེ་ན་རྩ་བ་དང་འབྲས་བུས་འཚོ་བར་བྱེད་པ་འདི་ནི་བྲམ་ཟེའི་ཁྱེའུ་བླ་ན་མེད་པའི་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་འདི་མངོན་སུམ་དུ་མ་བྱས་པ་མངོན་སུམ་དུ་བྱ་བ་ལ་ཐབས་མ་ཡིན་པ་དང་པོ་ཡིན་པར་རིག་པར་བྱའོ།
en: Saying, ‘Let us make our living from roots and fruits here,’ they do make their living from roots and fruits there. Young brahmin, this is the first wrong means for actualizing the unactualized supreme perfection of knowledge and conduct.

source: །བྲམ་ཟེའི་ཁྱེའུ་ཇི་སྙམ་དུ་སེམས།
en: What do you think, young brahmin?

source: ངས་གང་བླ་ན་མེད་པའི་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་དེའི་ཐབས་མ་ཡིན་པ་དང་པོ་འདི་བཤད་པ་དེ་ལ་ཁྱོད་སློབ་དཔོན་དང་བཅས་པར་སྣང་ངམ།
en: Do you find yourself with your teacher in the first wrong means that I have explained for actualizing the supreme perfection of knowledge and conduct not yet actualized?”

source: ཀྱེ་གཽ་ཏ་མ་མ་ལགས་སོ།
en: “No, Gautama, I do not.”

source: །བྲམ་ཟེའི་ཁྱེའུ་གཞན་ཡང་དགེ་སྦྱོང་ངམ་བྲམ་ཟེ་ཁ་ཅིག་བླ་ན་མེད་པའི་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་འདི་ཉིད་མངོན་པར་མ་རྟོགས་པར་རྩ་བ་དང་འབྲས་བུའི་ཟས་དེ་རྣམས་སྤངས་ནས་མཐའ་གཅིག་ཏུ་སོང་སྟེ། ཡལ་ག་དང་ལོ་མའི་སྤྱིལ་བུ་བྱས་ནས་གནས་པར་བྱེད་དེ།
en: “Young brahmin, again, some śramaṇas or brahmins, not actualizing this supreme perfection of knowledge and conduct, abandon the food of roots and fruits, go to a solitary place, and live there, having built huts of branches and leaves.

source: འདིར་བདག་ཅག་ལོ་མའི་ཟས་ཀྱིས་འཚོ་བར་བྱའོ་ཞེས་དེ་རྣམས་དེ་ན་ལོ་མའི་ཟས་ཀྱིས་འཚོ་བར་བྱེད་པ་འདི་ནི་བྲམ་ཟེའི་ཁྱེའུ་བླ་ན་མེད་པའི་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་དེ་མངོན་སུམ་དུ་མ་བྱས་པ་མངོན་སུམ་དུ་བྱ་བ་ལ་ཐབས་མ་ཡིན་པ་གཉིས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: Saying, ‘Let us make our living from the food of leaves here,’ they do make their living from the food of leaves there. Young brahmin, this is the second wrong means for actualizing the unactualized supreme perfection of knowledge and conduct.

source: །བྲམ་ཟེའི་ཁྱེའུ་གཞན་ཡང་དགེ་སྦྱོང་ངམ་བྲམ་ཟེ་ཁ་ཅིག་བླ་ན་མེད་པའི་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་འདི་ཉིད་མངོན་པར་མ་རྟོགས་པར་རྩ་བ་དང་འབྲས་བུའི་ཟས་དེ་དག་དང་། ལོ་མའི་ཟས་དེ་དག་སྤངས་ནས་མཐའ་གཅིག་ཏུ་སོང་སྟེ། ཡལ་ག་དང་ལོ་མའི་སྤྱིལ་བུ་བྱས་ནས་གནས་པར་བྱེད་དེ།
en: “Young brahmin, again, some śramaṇas or brahmins, not actualizing this supreme perfection of knowledge and conduct, abandon the food of roots and fruits and the food of leaves, go to a solitary place, and live there, having built huts of branches and leaves.

source: འདི་ན་བདག་ཅག་གསང་ཚིག་དག་གཞུང་དུ་བྱ་ཞིང་རིག་བྱེད་དག་བསྡེབ་པོ་ཞེས་དེ་རྣམས་གསང་ཚིག་དག་གཞུང་དུ་བྱེད་ཅིང་རིག་བྱེད་དག་སྡེབ་པ་སྟེ།
en: Saying, ‘Let us write mantras and compose Vedas here,’ they do write mantras and compose Vedas there.

source: འདི་ནི་བྲམ་ཟེའི་ཁྱེའུ་བླ་ན་མེད་པའི་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་དེ་མངོན་སུམ་དུ་མ་བྱས་པ་མངོན་སུམ་དུ་བྱ་བ་ལ་ཐབས་མ་ཡིན་པ་གསུམ་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: Young brahmin, this is the third wrong means for actualizing the unactualized supreme perfection of knowledge and conduct.

source: །བྲམ་ཟེའི་ཁྱེའུ་གཞན་ཡང་དགེ་སྦྱོང་ངམ་བྲམ་ཟེ་ཁ་ཅིག་བླ་ན་མེད་པའི་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་འདི་ཉིད་མངོན་པར་མ་རྟོགས་པར་རྩ་བ་དང་འབྲས་བུའི་ཟས་དེ་དག་དང་། ལོ་མའི་ཟས་དེ་དག་དང་། གསང་ཚིག་གི་གཞུང་དང་། རིག་བྱེད་བསྡེབ་པ་མངོན་པར་མ་རྟོགས་པར་དགོན་པ་ནས་གྲོང་མཐར་གནས་ནས་ཁྱིམ་སྒོ་བཞི་པ་བརྩིགས་ནས་གནས་པར་བྱེད་དེ།
en: “Young brahmin, again, some śramaṇas or brahmins, not actualizing this supreme perfection of knowledge and conduct, not actualizing the food of roots and fruits, the food of leaves, or writing mantras and composing Vedas, go from the wilderness to the edge of a village and live there, having built houses with four doorways.

source: འདིར་བདག་ཅག་སྦྱིན་པ་དག་གཏང་། བསོད་ནམས་དག་བྱ་སྟེ།
en: They think, ‘Let us give donations and make merit here.
